Revit 2027 API
AnalyticalLinkType.RotationX Property
 Fixity of rotation around X.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public AnalyticalFixityState RotationX { get; set; }
Public Property RotationX As AnalyticalFixityState
	Get
	Set
public:
property AnalyticalFixityState RotationX {
	AnalyticalFixityState get ();
	void set (AnalyticalFixityState value);
}
member RotationX : AnalyticalFixityState with get, set
Property Value
AnalyticalFixityState
Exceptions
Exception | Condition
ArgumentException |  When setting this property: The fixity state rotationX is not valid for Analytical Link Type parameters.
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
AnalyticalLinkType Class
Autodesk.Revit.DB.Structure Namespace